"use strict";

/*
Необходимо попросить пользователя ввести три числа.
Необходимо создать функцию, в которую мы должны передать эти три числа.
Функция должна определить максимальное, среди переданных ей значение и 
вывести сообщение: "Максимальное значение среди чисел N1, N2, N3 равно N."

Примечание: Условимся, что пользователь всегда вводит корректные значения, 
три числа. Проверять их не нужно.
*/

// const array = [];
// alert("Приготовьтесь ввести 3 числа");
// for (let index = 0; index < 3; index++) {
//   array[index] = Number(prompt("Введите число"));
// }

// (function () {
//   let max = -Infinity;
//   array.forEach((element) => {
//     if (element > max) {
//       max = element;
//     }
//   });
//   console.log(`Максимальное значение среди чисел ${array} равно ${max}`);
// })();
